Revit 2027 API
BuiltInFailures.SweepFailures.SweepFailed Property
 Proper sweep geometry creation failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SweepFailed { get; }
Public Shared ReadOnly Property SweepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SweepFailed {
	FailureDefinitionId^ get ();
}
static member SweepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace